Imported down all the necessary libraries which is thankfully just Pandas

In [1]:
import pandas as pd

Read the dataset using Pandas read_csv feature

In [2]:
dataset=pd.read_csv('bbb_odi_data.csv')

C:\Users\Vijay\AppData\Local\Temp\ipykernel_8612\2538919985.py:1: DtypeWarning: Columns (41,52,53) have mixed types. Specify dtype option on import or set low_memory=False.
  dataset=pd.read_csv('bbb_odi_data.csv')

Filtered out the dataset to get the instances only where the Current run rate was <=5 during the course of the game

In [3]:
dataset=dataset[dataset['inns']==2]
resultdf=dataset[(dataset['inns_rrr']>=6.00)]

An unnecessary column has been deleted

In [4]:
# resultdf.drop(columns='Unnamed: 0',index=1,inplace=True)

There are several columns and I chose only the ones meaningful to the related query by using a list.

In [5]:
req_cols=['bat','batruns','ballfaced']

Now, my dataset is filtered out to get only the required columns

In [6]:
result=resultdf[req_cols]

Grouped sum of the required columns gives us the overall aggregate of the data. I've reset the columns as well to include the names as a row value in the dataset.

In [7]:
grouped=result.groupby(['bat']).sum().reset_index()

In [8]:
grouped

                    bat  batruns  ballfaced
0        AB de Villiers     1637       1610
1           Aamer Yamin       94         95
2          Aamir Kaleem       13         16
3          Aarif Sheikh      332        442
4           Aaron Finch      644        758
...                 ...      ...        ...
1391       Ziaur Rahman       51         34
1392      Zubin Surkari       84        153
1393     Zulfiqar Babar       16         18
1394  Zulqarnain Haider       31         35
1395    Zunaed Siddique      306        381

[1396 rows x 3 columns]

I've used this different approach to sum the dismissals because there are some run out dismissals and not always it has been the striker who has gotten out, so based on the who_out? column values summation, I've found out the number of dismissals in this specific filter.

In [9]:
dis=pd.DataFrame(resultdf['who_out?'].value_counts()).reset_index()

This is an attempt to make a similar column in both the dataframes, and use it for joins later.

In [10]:
dis.rename({'index':'bat'},axis=1,inplace=True)

In [11]:
dis

                   bat  who_out?
0             MS Dhoni        63
1     Elton Chigumbura        57
2      Mushfiqur Rahim        49
3        Shahid Afridi        48
4      Shakib Al Hasan        48
...                ...       ...
1306     Navdeep Saini         1
1307     Morne van Wyk         1
1308     Akshay Homraj         1
1309     Luke Woodcock         1
1310     Matthew Forde         1

[1311 rows x 2 columns]

A left join has been performed on the left dataset which is the grouped data and then they've been joined on 'bat' column

In [12]:
finalresult=pd.merge(grouped,dis,how='left',on='bat')

Now, they've been sorted by descending order of 'batruns' and this operation has been performed in place to reflect the changes

In [13]:
finalresult.sort_values(by='batruns',ascending=False,inplace=True)

The resultant column names have been renamed for easier interpretation

In [14]:
finalresult.rename({'who_out?':'dismissals','batruns':'runs','ballfaced':'balls'},axis=1,inplace=True)

In [15]:
finalresult

                   bat  runs  balls  dismissals
1345       Virat Kohli  3202   3238        46.0
735           MS Dhoni  2503   3174        63.0
1050      Rohit Sharma  1923   2068        48.0
1145   Shakib Al Hasan  1829   2182        48.0
681   Kumar Sangakkara  1727   1775        37.0
...                ...   ...    ...         ...
240       Chris Martin     0      2         1.0
239         Chris Lynn     0      1         1.0
676       Kjorn Ottley     0      4         1.0
231    Charlton Tshuma     0      1         1.0
135         Asif Iqbal     0      1         1.0

[1396 rows x 4 columns]

Before performing mathematical operations to find out the averages and strike rates, I've actually verified if the data types are suitable for calculations or not. Since both are of the same 'integer' type, it is easier for me to perform the operations.

In [16]:
finalresult.dtypes

bat            object
runs            int64
balls           int64
dismissals    float64
dtype: object

The averages and Runs Per Over (rpo) were calculated from the existing data and were rounded off to the 2 nearest decimal places.

In [17]:
finalresult['avg']=(finalresult['runs']/finalresult['dismissals'])
finalresult['avg']=round(finalresult['avg'],2)

In [18]:
finalresult['rpo']=(finalresult['runs']*6/finalresult['balls'])
finalresult['rpo']=round(finalresult['rpo'],2)

The end result has been saved to a csv file to use them further for visualizations on tableau

In [19]:
finalresult.to_csv('above6.csv')

In [20]:
finalresult

                   bat  runs  balls  dismissals    avg   rpo
1345       Virat Kohli  3202   3238        46.0  69.61  5.93
735           MS Dhoni  2503   3174        63.0  39.73  4.73
1050      Rohit Sharma  1923   2068        48.0  40.06  5.58
1145   Shakib Al Hasan  1829   2182        48.0  38.10  5.03
681   Kumar Sangakkara  1727   1775        37.0  46.68  5.84
...                ...   ...    ...         ...    ...   ...
240       Chris Martin     0      2         1.0   0.00  0.00
239         Chris Lynn     0      1         1.0   0.00  0.00
676       Kjorn Ottley     0      4         1.0   0.00  0.00
231    Charlton Tshuma     0      1         1.0   0.00  0.00
135         Asif Iqbal     0      1         1.0   0.00  0.00

[1396 rows x 6 columns]